PHOTO_NONO = "사진 업로드는 지원되지 않습니다."
GIVE_ME_NAMECARD = "명함 만들어주세요"
HELLO = "안녕하세요! 저는 자기이해 프로젝트 ‘날리다’의 알리미와 챗봇 그리고 귀요미를 담당하는 날리냥이라고 해요. "
I_AM_PRO_NAMECARDER = "네! 저도 당신을 만나서 반가워요. 지금은 직업을 조금 바꿔서 프로명함러로 일하고 있어요. 이벤트에 참여해주신 분들 중 추첨을 통해 50분께 실제로 명함을 만들어드리고 있어요!"
DO_YOU_WANT_NALIDA_DETAIL = "알겠어요! 그런데 자기이해 프로젝트가 무엇인지 잘 모르시겠다구요? 혹시 날리다가 무엇인지 좀 더 알고 싶으신가요?"
NALIDA_TMI = """날리냥이 그럼 소개해줄게요!
‘날리다’는 자기이해를 위한 워크샵을 기획하고 실행하는 단체입니다. 저희는 오늘날 사람들이 하는 다양한 고민들이 자기 이해로부터 해결될 수 있다고 생각했어요. 날리다는 다양한 종류의 워크샵을 통해 혼자서는 하기 어려운 자기 이해를 차근차근 할 수 있는 기회를 제공하고 있어요. 워크샵이 끝나면 자신을 나타낼 수 있는 예쁜 선물까지 챙겨갈 수 있어요.

날리다는 이런 사람들에게 좋아요!
-   내가 진짜 좋아하는 게 무엇인지 헷갈리는 분
-   특별한 나를 표현하는 자기브랜딩이 필요한 사람
-   너무 지쳐서 잠시 쉬고 싶은 분
-   무언가를 바꾸고 싶은데 그 ‘무언가’를 찾고 싶은 사람

날리다가 무엇인지 조금 이해가 되셨으면 좋겠어요!
그리고 혹시 더 궁금하면 fb.me/nalida2 를 방문해보시는 걸 추천드려요!"""

OKAY_BYE = "알겠어요! 다음에 혹시 궁금하면 날리냥에게 카톡해요!"

PERSONAL_INFO_OKAY =  "앗 맞다! 지금 날리냥이 만들어줄게요. 명함을 만들려면 당신에게 몇 가지 정보를 물어봐야 해요. 저는 이름/별명/이니셜/전화번호/한줄 자기소개 를 물어볼 건데, 괜찮아요?"

AGREE_STATEMENT = "좋아요! 그리고 이름과 전화번호는 개인정보라서 특별히 당신의 동의가 필요해요. 개인정보 수집에 동의하면 1, 아니면 2를 입력해주세요!"
WRONG_RESPONSE = "잘못된 입력이에요. 다시 입력해주세요!"
ASK_NAME = "고마워요! 그러면 지금부터 명함을 만들어 볼게요. 당신의 이름이 뭐예요?"
ASK_NICK = '혹시 별명도 있나요? 없다면 "없음"이라고 입력해주세요.'
ASK_INITIAL = "오오 좋은 별명을 가지고 있네요! 그럼 당신의 이름을 대표하는 알파벳 하나를 고르라면 뭐예요?"
ASK_INITIAL_NO_NICK = "그럼 당신의 이름을 대표하는 알파벳 하나를 고르라면 뭐예요?"
ASK_NUMBER = "당신의 전화번호를 입력해주세요! (예: 01012345678)"
ASK_INTRO = "거의 다 왔어요! 이제 제일 어려운 건데… 한줄 자기소개를 해줄 수 있나요? 40자가 넘으면 안 돼요!"
ASK_COLOR = "명함에 들어갈 포인트 컬러를 번호로 골라주세요! 예) 11"
HAO_MA = "어때요! 마음에 들어요? 이메일로 명함 보내줄까요?"
EMAIL_PLEASE = "이메일 주소를 입력해주세요! "
AUTH_PLEASE = "입력해주신 이메일 주소로 인증번호가 하나 발송되었어요! 여기에 한번 입력해줄래요?"
CHECK_YOUR_MAIL = "고마워요! 명함이 곧 도착할 거에요! 이메일 수신메일함을 확인해보세요! 만약 오지 않았다면 스팸메일함도 확인해보세요!"
FILE_WRONG = "파일 유효기간이 만료되었거나 메일 주소에 문제가 있는 것 같아요. 명함 만들기 작업을 다시 진행해주세요 ㅠㅠ"
OKAY_BYE_2 = "그렇구나! 알겠어요 고마워요! 또 명함이 필요하면 날리냥을 찾아줘요!"
